R1 Console
enable
conf t
hostname R1
interface Lo1
ip address 192.168.1.1 255.255.255.0
exit
interface s1/0
ip address 172.16.12.1 255.255.255.248
no shutdown
exit
interface s1/1
ip address 172.16.13.1 255.255.255.248
no shutdown
exit
router eigrp 100
network 192.168.1.0
network 172.16.12.0
network 172.16.13.0
no auto-summary
exit
R1#sh ip eigrp neighbors
R1#sh ip route

R2 Console
Router>enable
Router#conf t
Router(config)#hostname R2
R2(config)#interface Lo2
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#exit
R2(config)#interface s1/0
R2(config-if)#ip address 172.16.12.2 255.255.255.248
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#interface s1/1
R2(config-if)#ip address 172.16.23.2 255.255.255.248
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#router eigrp 100
R2(config-router)#network 192.168.2.0
R2(config-router)#network 172.16.12.0
R2(config-router)#network 172.16.23.0
R2(config-router)#no auto-summary
R2#sh ip eigrp neighbors

R3 Console
Router>enable
Router#conf t
Router(config)#hostname R3
R3(config)#interface Lo3
R3(config-if)#ip address 192.168.3.1 255.255.255.0
R3(config-if)#exit
R3(config)#interface s1/0
R3(config-if)#ip address 172.16.13.3 255.255.255.248
R3(config-if)#no shutdown
R3(config-if)#exit
R3(config)#interface s1/1
R3(config-if)#ip address 172.16.23.3 255.255.255.248
R3(config-if)#no shutdown
R3(config-if)#exit
R3(config)#interface s1/2
R3(config-if)#ip address 172.16.34.3 255.255.255.248
R3(config-if)#no shutdown
R3(config-if)#exit
R3(config)#router eigrp 100
R3(config-router)#network 192.168.3.0
R3(config-router)#network 172.16.13.0
R3(config-router)#network 172.16.23.0
R3(config-router)#network 172.16.34.0
R3(config-router)#no auto-summary
R3#sh ip eigrp neighbors

R3(config)#ip access-list standard PBR-ACL
R3(config-std-nacl)#remark ACL matches R4 LAN B traffic
R3(config-std-nacl)#permit 192.168.4.128 0.0.0.127
R3(config-std-nacl)#exit
R3(config)#route-map R3-to-R1 permit
R3(config-route-map)#match ip address PBR-ACL
R3(config-route-map)#set ip next-hop 172.16.13.1
R3(config-route-map)#end
R3(config)#int s1/2
R3(config-if)#ip policy route-map R3-to-R1
R3(config-if)#exit
R3#sh route-map

R3(config)#access-list 1 permit 192.168.4.0 0.0.0.255

R4 Console
Router>enable
Router#conf t
Router(config)#hostname R4
R4(config)#interface lo4
R4(config-if)#ip address 192.168.4.1 255.255.255.128
R4(config-if)#exit
R4(config)#interface lo5                         
R4(config-if)#ip address 192.168.4.129 255.255.255.128
R4(config-if)#exit
R4(config)#interface s1/0
R4(config-if)#ip address 172.16.34.4 255.255.255.248
R4(config-if)#no shutdown
R4(config-if)#exit
R4(config)#router eigrp 100
R4(config-router)#network 192.168.4.0
R4(config-router)#network 172.16.34.0
R4(config-router)#no auto-summary
R4#sh ip eigrp neighbors

Before Route Maps
R4#traceroute 192.168.1.1 source 192.168.4.1

R4#traceroute 192.168.1.1 source 192.168.4.129
